basic_task/jmeter.log
2021-06-03 20:38:24,923 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2021-06-03 20:38:24,949 INFO o.a.j.JMeter: Loading user properties from: /home/rohit/.local/bin/jmeter/bin/user.properties
2021-06-03 20:38:24,949 INFO o.a.j.JMeter: Loading system properties from: /home/rohit/.local/bin/jmeter/bin/system.properties
2021-06-03 20:38:24,956 INFO o.a.j.JMeter: Copyright (c) 1998-2021 The Apache Software Foundation
2021-06-03 20:38:24,957 INFO o.a.j.JMeter: Version 5.4.1
2021-06-03 20:38:24,957 INFO o.a.j.JMeter: java.version=11.0.11
2021-06-03 20:38:24,957 INFO o.a.j.JMeter: java.vm.name=OpenJDK 64-Bit Server VM
2021-06-03 20:38:24,957 INFO o.a.j.JMeter: os.name=Linux
2021-06-03 20:38:24,957 INFO o.a.j.JMeter: os.arch=amd64
2021-06-03 20:38:24,957 INFO o.a.j.JMeter: os.version=5.4.72-microsoft-standard-WSL2
2021-06-03 20:38:24,957 INFO o.a.j.JMeter: file.encoding=UTF-8
2021-06-03 20:38:24,957 INFO o.a.j.JMeter: java.awt.headless=true
2021-06-03 20:38:24,957 INFO o.a.j.JMeter: Max memory     =1073741824
2021-06-03 20:38:24,957 INFO o.a.j.JMeter: Available Processors =8
2021-06-03 20:38:24,966 INFO o.a.j.JMeter: Default Locale=English (EN)
2021-06-03 20:38:24,966 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2021-06-03 20:38:24,967 INFO o.a.j.JMeter: JMeterHome=/home/rohit/.local/bin/jmeter
2021-06-03 20:38:24,967 INFO o.a.j.JMeter: user.dir  =/home/rohit/jmeter
2021-06-03 20:38:24,967 INFO o.a.j.JMeter: PWD       =/home/rohit/jmeter
2021-06-03 20:38:24,967 INFO o.a.j.JMeter: IP: 127.0.1.1 Name: bullst FullName: bullst.localdomain
2021-06-03 20:38:24,970 INFO o.a.j.JMeter: Setting property 'jmeter.reportgenerator.outputdir' to:'/home/rohit/jmeter/result'
2021-06-03 20:38:24,974 INFO o.a.j.s.FileServer: Default base='/home/rohit/jmeter'
2021-06-03 20:38:24,975 INFO o.a.j.s.FileServer: Set new base='/home/rohit/jmeter'
2021-06-03 20:38:25,144 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2021-06-03 20:38:25,188 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2021-06-03 20:38:25,191 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2021-06-03 20:38:25,194 INFO o.a.j.s.SaveService: Loading file: FirstTest.jmx
2021-06-03 20:38:25,238 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2021-06-03 20:38:25,238 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2021-06-03 20:38:25,238 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2021-06-03 20:38:25,239 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2021-06-03 20:38:25,239 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2021-06-03 20:38:25,239 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2021-06-03 20:38:25,321 INFO o.a.j.JMeter: Creating summariser <summary>
2021-06-03 20:38:25,326 INFO o.a.j.r.d.ReportGenerator: ReportGenerator will use for Parsing the separator: ','
2021-06-03 20:38:25,326 INFO o.a.j.r.d.ReportGenerator: Will generate report at end of test from  results file: test.log
2021-06-03 20:38:25,326 INFO o.a.j.r.d.ReportGenerator: Reading report generator properties from: /home/rohit/.local/bin/jmeter/bin/reportgenerator.properties
2021-06-03 20:38:25,327 INFO o.a.j.r.d.ReportGenerator: Merging with JMeter properties
2021-06-03 20:38:25,331 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.temp_dir' not found, using default value 'temp' instead.
2021-06-03 20:38:25,333 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.apdex_per_transaction' not found, using default value 'null' instead.
2021-06-03 20:38:25,333 INFO o.a.j.r.c.ReportGeneratorConfiguration: apdex_per_transaction is empty, not APDEX per transaction customization
2021-06-03 20:38:25,334 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.sample_filter' not found, using default value 'null' instead.
2021-06-03 20:38:25,334 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.report_title' not found, using default value 'null' instead.
2021-06-03 20:38:25,334 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.start_date' not found, using default value 'null' instead.
2021-06-03 20:38:25,334 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.end_date' not found, using default value 'null' instead.
2021-06-03 20:38:25,334 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.date_format' not found, using default value 'null' instead.
2021-06-03 20:38:25,335 INFO o.a.j.r.c.ReportGeneratorConfiguration: Will use date range start date: null, end date: null
2021-06-03 20:38:25,338 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.totalTPS.exclude_controllers' not found, using default value 'false' instead.
2021-06-03 20:38:25,338 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.activeThreadsOverTime.exclude_controllers' not found, using default value 'false' instead.
2021-06-03 20:38:25,338 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.timeVsThreads.exclude_controllers' not found, using default value 'false' instead.
2021-06-03 20:38:25,339 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimeDistribution.exclude_controllers' not found, using default value 'false' instead.
2021-06-03 20:38:25,339 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.transactionsPerSecond.exclude_controllers' not found, using default value 'false' instead.
2021-06-03 20:38:25,339 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimePercentiles.exclude_controllers' not found, using default value 'false' instead.
2021-06-03 20:38:25,339 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimePercentilesOverTime.exclude_controllers' not found, using default value 'false' instead.
2021-06-03 20:38:25,339 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimesOverTime.exclude_controllers' not found, using default value 'false' instead.
2021-06-03 20:38:25,340 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.connectTimeOverTime.exclude_controllers' not found, using default value 'false' instead.
2021-06-03 20:38:25,340 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.latenciesOverTime.exclude_controllers' not found, using default value 'false' instead.
2021-06-03 20:38:25,341 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.json.filters_only_sample_series' not found, using default value 'true' instead.
2021-06-03 20:38:25,341 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.json.series_filter' not found, using default value '' instead.
2021-06-03 20:38:25,341 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.json.show_controllers_only' not found, using default value 'false' instead.
2021-06-03 20:38:25,342 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.filters_only_sample_series' not found, using default value 'true' instead.
2021-06-03 20:38:25,342 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.series_filter' not found, using default value '' instead.
2021-06-03 20:38:25,342 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.show_controllers_only' not found, using default value 'false' instead.
2021-06-03 20:38:25,346 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2021-06-03 20:38:25,348 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2021-06-03 20:38:25,348 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2021-06-03 20:38:25,371 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2021-06-03 20:38:25,371 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2021-06-03 20:38:26,004 INFO o.a.j.JMeter: Running test (1622732906004)
2021-06-03 20:38:26,026 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : Google
2021-06-03 20:38:26,026 INFO o.a.j.e.StandardJMeterEngine: Starting 1 threads for group Google.
2021-06-03 20:38:26,027 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2021-06-03 20:38:26,027 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=1 ramp-up=1 delayedStart=false
2021-06-03 20:38:26,041 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2021-06-03 20:38:26,041 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2021-06-03 20:38:26,058 INFO o.a.j.t.JMeterThread: Thread started: Google 1-1
2021-06-03 20:38:26,078 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = bullst
2021-06-03 20:38:26,084 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2021-06-03 20:38:26,085 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2021-06-03 20:38:26,085 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to ISO-8859-1
2021-06-03 20:38:26,086 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2021-06-03 20:38:26,086 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2021-06-03 20:38:26,188 INFO o.a.j.p.h.s.h.LazyLayeredConnectionSocketFactory: Setting up HTTPS TrustAll Socket Factory
2021-06-03 20:38:26,195 INFO o.a.j.u.JsseSSLManager: Using default SSL protocol: TLS
2021-06-03 20:38:26,195 INFO o.a.j.u.JsseSSLManager: SSL session context: per-thread
2021-06-03 20:38:26,278 INFO o.a.j.u.SSLManager: JmeterKeyStore Location:  type JKS
2021-06-03 20:38:26,282 INFO o.a.j.u.SSLManager: KeyStore created OK
2021-06-03 20:38:26,282 WARN o.a.j.u.SSLManager: Keystore file not found, loading empty keystore
2021-06-03 20:38:29,986 INFO o.a.j.t.JMeterThread: Thread is done: Google 1-1
2021-06-03 20:38:29,987 INFO o.a.j.t.JMeterThread: Thread finished: Google 1-1
2021-06-03 20:38:29,994 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2021-06-03 20:38:30,000 INFO o.a.j.r.Summariser: summary =      5 in 00:00:04 =    1.3/s Avg:   724 Min:   570 Max:   914 Err:     0 (0.00%)
2021-06-03 20:38:30,002 INFO o.a.j.JMeter: Generating Dashboard
2021-06-03 20:38:30,002 INFO o.a.j.r.d.ReportGenerator: Flushing result collector before report Generation
2021-06-03 20:38:30,056 INFO o.a.j.r.p.NormalizerSampleConsumer: Using format, 'ms', to parse timeStamp field
2021-06-03 20:38:30,163 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.AggregateConsumer#stopProducing(): beginDate produced 0 samples
2021-06-03 20:38:30,163 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.AggregateConsumer#stopProducing(): endDate produced 0 samples
2021-06-03 20:38:30,165 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.ApdexSummaryConsumer#stopProducing(): apdexSummary produced 0 samples
2021-06-03 20:38:30,165 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.RequestsSummaryConsumer#stopProducing(): requestsSummary produced 0 samples
2021-06-03 20:38:30,175 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.StatisticsSummaryConsumer#stopProducing(): statisticsSummary produced 0 samples
2021-06-03 20:38:30,177 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.Top5ErrorsBySamplerConsumer#stopProducing(): top5ErrorsBySampler produced 0 samples
2021-06-03 20:38:30,177 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.ErrorsSummaryConsumer#stopProducing(): errorsSummary produced 0 samples
2021-06-03 20:38:30,177 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.HitsPerSecondGraphConsumer#stopProducing(): hitsPerSecond produced 0 samples
2021-06-03 20:38:30,188 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.LatencyVSRequestGraphConsumer#stopProducing(): latencyVsRequest produced 0 samples
2021-06-03 20:38:30,188 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.SyntheticResponseTimeDistributionGraphConsumer#stopProducing(): syntheticResponseTimeDistribution produced 0 samples
2021-06-03 20:38:30,188 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.BytesThroughputGraphConsumer#stopProducing(): bytesThroughputOverTime produced 0 samples
2021-06-03 20:38:30,189 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.CodesPerSecondGraphConsumer#stopProducing(): codesPerSecond produced 0 samples
2021-06-03 20:38:30,190 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimeVSRequestGraphConsumer#stopProducing(): responseTimeVsRequest produced 0 samples
2021-06-03 20:38:30,191 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.FilterConsumer#stopProducing(): startIntervalControlerFilter produced 35 samples
2021-06-03 20:38:30,191 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.TotalTPSGraphConsumer#stopProducing(): totalTPS produced 0 samples
2021-06-03 20:38:30,191 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ActiveThreadsGraphConsumer#stopProducing(): activeThreadsOverTime produced 0 samples
2021-06-03 20:38:30,191 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.TimeVSThreadGraphConsumer#stopProducing(): timeVsThreads produced 0 samples
2021-06-03 20:38:30,191 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimeDistributionGraphConsumer#stopProducing(): responseTimeDistribution produced 0 samples
2021-06-03 20:38:30,191 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.TransactionsPerSecondGraphConsumer#stopProducing(): transactionsPerSecond produced 0 samples
2021-06-03 20:38:30,192 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimePercentilesGraphConsumer#stopProducing(): responseTimePercentiles produced 0 samples
2021-06-03 20:38:30,192 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimePercentilesOverTimeGraphConsumer#stopProducing(): responseTimePercentilesOverTime produced 0 samples
2021-06-03 20:38:30,193 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimeOverTimeGraphConsumer#stopProducing(): responseTimesOverTime produced 0 samples
2021-06-03 20:38:30,193 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ConnectTimeOverTimeGraphConsumer#stopProducing(): connectTimeOverTime produced 0 samples
2021-06-03 20:38:30,193 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.LatencyOverTimeGraphConsumer#stopProducing(): latenciesOverTime produced 0 samples
2021-06-03 20:38:30,193 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.FilterConsumer#stopProducing(): nameFilter produced 75 samples
2021-06-03 20:38:30,193 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.FilterConsumer#stopProducing(): dateRangeFilter produced 15 samples
2021-06-03 20:38:30,193 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.NormalizerSampleConsumer#stopProducing(): normalizer produced 5 samples
2021-06-03 20:38:30,194 INFO o.a.j.r.p.CsvFileSampleSource: produce(): 5 samples produced in 75ms on channel 0
2021-06-03 20:38:30,194 INFO o.a.j.r.d.ReportGenerator: Exporting data using exporter:'json' of className:'org.apache.jmeter.report.dashboard.JsonExporter'
2021-06-03 20:38:30,396 INFO o.a.j.r.d.JsonExporter: Found data for consumer statisticsSummary in context
2021-06-03 20:38:30,397 INFO o.a.j.r.d.JsonExporter: Creating statistics for overall
2021-06-03 20:38:30,398 INFO o.a.j.r.d.JsonExporter: Creating statistics for other transactions
2021-06-03 20:38:30,400 INFO o.a.j.r.d.JsonExporter: Checking output folder
2021-06-03 20:38:30,401 INFO o.a.j.r.d.JsonExporter: Writing statistics JSON to /home/rohit/jmeter/result/statistics.json
2021-06-03 20:38:30,515 INFO o.a.j.r.d.ReportGenerator: Exporting data using exporter:'html' of className:'org.apache.jmeter.report.dashboard.HtmlTemplateExporter'
2021-06-03 20:38:30,521 INFO o.a.j.r.d.HtmlTemplateExporter: Will generate dashboard in folder: /home/rohit/jmeter/result
2021-06-03 20:38:30,648 INFO o.a.j.r.d.HtmlTemplateExporter: Report will be generated in: /home/rohit/jmeter/result, creating folder structure
2021-06-03 20:38:30,651 INFO o.a.j.r.d.TemplateVisitor: Copying folder from '/home/rohit/.local/bin/jmeter/bin/report-template' to '/home/rohit/jmeter/result', got message: /home/rohit/jmeter/result, found non empty folder with following content [/home/rohit/jmeter/result/statistics.json], will be ignored
2021-06-03 20:38:30,838 INFO o.a.j.JMeter: Dashboard generated